app/Controllers/admin/CategoryController.php

SELECT *
FROM `categories`
WHERE `id` = '8'
 LIMIT 1
---
     function getinfo($id=false){
        $data = $this->categoryModel->where(['id' => decryptor($id)])->first();