app/Controllers/admin/CategoryController.php

SELECT *
FROM `categories`
ORDER BY `level` ASC
---
    function index(){
        $page = (hasPermission('','category') ?  ucwords(getappdata('category')) : lang('Custom.permissionDenied'));
        $route = (hasPermission('','category') ? 'admin/category/category' :'admin/pages-error-404');
        $roles = $this->categoryModel->orderBy('level','ASC')->findAll();

SELECT *
FROM `categories`
WHERE `categories`.`id` = '7'
---
        }
        $level = 1;
        if ($parentId) {
            $parent = $this->categoryModel->find($parentId);

UPDATE `categories` SET `category` = 'LIGAMENTOUS PROCEDURES', `parent_id` = '7', `image` = 'uploads/categories/1776699773_f2dac7db4ca970b38751.webp', `description` = 'The ACL (Anterior Cruciate Ligament) is a strong band of tissue inside the knee. It connects the thigh bone (femur) to the\r\nshin bone (tibia). Its main job isto keep your knee stable during movement, especially when twisting or turning', `slug` = 'ligamentous-procedures', `level` = 3
WHERE `categories`.`id` IN ('1')
---

        if($id)
        {
            if($this->categoryModel->update($id, $data)){