app/Controllers/admin/ServiceController.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
AND `parent_id` = 0
---
     public function index() {
        $page = (hasPermission('','service') ?  ucwords(string: getappdata('services')) : lang('Custom.permissionDenied'));
        $route = (hasPermission('','service') ? 'admin/services/index' :'admin/pages-error-404');
        $categories = $this->categoryModel->where(['is_active' => 1,'parent_id'=>0])->findAll();