app/Controllers/HomeController.php

    public function index() {
        helper('text');
        $page = 'Home';
        $banner = $this->sliderModel->where(['status' => 1 ])->orderBy('id','DESC')->get()->getResult();
        $expertise = $this->expertiseModel->where(['status' => 1])->orderBy('title','ASC')->get()->getResult();
        $feedback = $this->feedbackModel->where(['status' => 1])->orderBy('id','DESC')->get()->getResult();
        $news  = $this->newsModel->where(['status' => 1])->orderBy('id','DESC')->limit(3)->get()->getResult();
---
SELECT *
FROM `slider`
WHERE `status` = 1
ORDER BY `id` DESC
SELECT *
FROM `expertise`
WHERE `status` = 1
ORDER BY `title` ASC
SELECT *
FROM `feedback`
WHERE `status` = 1
ORDER BY `id` DESC
SELECT *
FROM `news`
WHERE `status` = 1
ORDER BY `id` DESC
 LIMIT 3