app/Controllers/ServiceController.php

SELECT *
FROM `services`
WHERE `slug` = 'orthobiologics-regenerative-procedures'
---
    function singleDetails($slug) {
        $page = "Services";
        $servicesData = [];
        $titleBar = [];
        $services = $this->serviceModel->where('slug', $slug)->get()->getRow();