app/Controllers/ServiceController.php

    public function details($slug=false) {
        $page = "Services";
            $serviceItems = [
            'title'        => '',
            'short_note'   => '',
            'description'  => '',
            'image'        => '',
            'pointtitle'   => '',
            'varianttitle' => '',
            'icon'         => '',
            'points'       => [],
            'cards'        => [],
            'gallery'      => [],
        ];
        $routeView ='';
        $servicesData = [];
        $titleBar = [];

        $category = $this->categoryModel->select('id')->where('slug', $slug)->get()->getRow();

        if ($category) {
            $services = $this->serviceModel->where('category_id', $category->id)->get()->getResult();
---
SELECT `id`
FROM `categories`
WHERE `slug` = 'knee'
SELECT *
FROM `services`
WHERE `category_id` = '7'

    function singleDetails($slug) {
        $page = "";
        $subTitle = '';
        $servicesData = [];
        $titleBar = [];
        //first select category name and parent_id = 7 name knee also select

        $builder = $this->categoryModel->builder('categories s');

        $category = $builder
            ->select('s.id, s.category, s.parent_id,pc.category as maincategory,pc.slug')
            ->join('categories pc', 'pc.id = s.parent_id', 'left')
            ->where(['s.slug'=>$slug,'s.isactive'=>1])->get()->getRow();
        $services = $this->serviceModel->where('sub_category', $category->id)->get()->getResult();
---
SELECT `s`.`id`, `s`.`category`, `s`.`parent_id`, `pc`.`category` as `maincategory`, `pc`.`slug`
FROM `categories` `s`
LEFT JOIN `categories` `pc` ON `pc`.`id` = `s`.`parent_id`
WHERE `s`.`slug` = 'diagnostic-arthroscopy'
AND `s`.`is_active` = 1
SELECT *
FROM `services`
WHERE `sub_category` = '8'