app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
    function getdata($search=false,$filter=false) {
        $builder = $this->db->table('categories')
                ->where(['is_active' => 1]);
        if($search){
            $builder->like('category',$search);
        }
         if($filter){
            $builder->like('is_active',$filter);
        }
        $builder->orderBy('sort_order','ASC');
        return $builder->get()->getResultArray();