app/Models/ServiceModel.php

    public function getData($id = false,$search='',$orderBy ='',$condition=false) {
        $builder = $this->db->table('services as s')
            ->select('s.id,s.slug,s.title,s.maincate_order,s.point_title,s.variant_title,s.short_note,s.image,s.description,s.category_id,s.sub_category,sh.points,sh.id as pointId,sg.image_url,sg.id as imgId,v.id as varintId,
          v.title as varinttitle,v.short_note as variantdesc,v.image as varintImg,s.icon,sh.remarks,
          si.id as subimgId,si.image subImage'
          )
            ->join('service_highlights as sh','sh.service_id = s.id','left')
             ->join('servicegallery as sg','s.id = sg.service_id','left')
            ->join('variants as v','s.id = v.service_id','left')
            ->join('service_sub_image as si','si.service_id = v.id','left')
            ->where('s.status',1)
            ->orderBy('s.id','DESC');
            if($id){
                $builder->where(['s.id' => $id]);
            }
            if($search) {
                $builder->like('s.title',$search);
            }
            if($condition) {
                $builder->where($condition);
            }
            return $builder->get()->getResultArray();
---
SELECT `s`.`id`, `s`.`slug`, `s`.`title`, `s`.`point_title`, `s`.`variant_title`, `s`.`short_note`, `s`.`image`, `s`.`description`, `s`.`category_id`, `s`.`sub_category`, `sh`.`points`, `sh`.`id` as `pointId`, `sg`.`image_url`, `sg`.`id` as `imgId`, `v`.`id` as `varintId`, `v`.`title` as `varinttitle`, `v`.`short_note` as `variantdesc`, `v`.`image` as `varintImg`, `s`.`icon`, `sh`.`remarks`, `si`.`id` as `subimgId`, `si`.`image` `subImage`
FROM `services` as `s`
LEFT JOIN `service_highlights` as `sh` ON `sh`.`service_id` = `s`.`id`
LEFT JOIN `servicegallery` as `sg` ON `s`.`id` = `sg`.`service_id`
LEFT JOIN `variants` as `v` ON `s`.`id` = `v`.`service_id`
LEFT JOIN `service_sub_image` as `si` ON `si`.`service_id` = `v`.`id`
WHERE `s`.`status` = 1
ORDER BY `s`.`id` DESC

    public function getUniqueCategories()
    {
        return $this->db->table('services as s')
            ->select('
                s.id, s.slug, s.title, s.short_note, s.image,
                s.sub_category,
                pc.category as parent_category,
                sc.category as sub_category_title
            ')
            ->join('categories as pc', 'pc.id = s.category_id', 'left')
            ->join('categories as sc', 'sc.id = s.sub_category', 'left')
            ->where('s.status', 1)
            ->groupBy('s.category_id')
            ->orderBy('s.sub_category', 'DESC')
            ->get()
            ->getResult();
---
SELECT `s`.`id`, `s`.`slug`, `s`.`title`, `s`.`short_note`, `s`.`image`, `s`.`sub_category`, `pc`.`category` as `parent_category`, `sc`.`category` as `sub_category_title`
FROM `services` as `s`
LEFT JOIN `categories` as `pc` ON `pc`.`id` = `s`.`category_id`
LEFT JOIN `categories` as `sc` ON `sc`.`id` = `s`.`sub_category`
WHERE `s`.`status` = 1
GROUP BY `s`.`category_id`
ORDER BY `s`.`sub_category` DESC

        public function serviceDetails2($serviceId = false,$search='',$condition=false) {
         $builder = $this->db->table('services as s')
            ->select('s.id,s.slug,s.title,s.variant_title,s.short_note,s.image,s.description,s.category_id,
           v.id as varintId,
            v.service_id as variantServiceId,v.title as varinttitle,v.short_note as variantdesc,v.image as varintImg,s.icon,
            si.image as subImg')
            ->join('variants as v','s.id = v.service_id','left')
            ->join('service_sub_image as si','v.id = si.service_id','left')
            ->where('s.status',1)
            ->orderBy('s.id','DESC');
---
SELECT `s`.`id`, `s`.`slug`, `s`.`title`, `s`.`variant_title`, `s`.`short_note`, `s`.`image`, `s`.`description`, `s`.`category_id`, `v`.`id` as `varintId`, `v`.`service_id` as `variantServiceId`, `v`.`title` as `varinttitle`, `v`.`short_note` as `variantdesc`, `v`.`image` as `varintImg`, `s`.`icon`, `si`.`image` as `subImg`
FROM `services` as `s`
LEFT JOIN `variants` as `v` ON `s`.`id` = `v`.`service_id`
LEFT JOIN `service_sub_image` as `si` ON `v`.`id` = `si`.`service_id`
WHERE `s`.`status` = 1
AND `s`.`id` = '37'
ORDER BY `s`.`id` DESC